# Напишите программу на Python, которая включает в себя функцию greeting, выводящую приветственное сообщение, и вызовите эту функцию.

# Задачи:

# Создайте функцию с названием greeting.
# Внутри функции используйте команду printдля вывода сообщения "Hello world!".
# После объявления функции вызовите ее, чтобы увидеть сообщение на экране.
# Ожидаемый результат:

# Когда программа выполняется, она должна вывести "Hello world!"на экран.

# Подсказки:

# Вызов функции выполняется с помощью ее имени и пары круглых скобок.

def greeting():
    print("Hello world!")

greeting()